{"html":"<p>The Java Virtual Machine (JVM) is a program that executes other programs.</p>\n<br>\n\n<h1 style=\"font-size:3em;\">What is it used for?</h1>\n\n<p>The JVM has two main functions:</p>\n<ol>\n<li>Allow Java programs to run on any device or operating system (Write Once, Run Anywhere).</li>\n<li>Manage and optimise program memory</li>\n</ol>\n<p>Before the introduction of Java and the JVM, software developers had to write code specific to an operating system and manage program memory themselves.</p>\n<div id=\"imageDiv\">\n  <figure>\n    <img src=\"https://joshlearningtocode.files.wordpress.com/2021/09/jvm.png\" alt=\"JVM\"/>\n    <figcaption>JVM</figcaption>\n  </figure>\n</div>\n\n<p>The JVM provides a runtime environment for Java code. We can configure the JVM&#39;s settings before running, which allows us to set certain constraints and then we rely on it to manage resources during execution.</p>\n<br>\n\n<h1 style=\"font-size:3em;\">Resource Management in the JVM</h1>\n\n<p>The JVM handles memory allocation and therefore one of the most common interactions with the JVM is to check memory usage. As memory allocation is happening automatically and dynamically in the JVM, it uses a process called <em><strong>Garbage Collection</strong></em> to manage the memory. GC identifies unused memory and clears it. Originally this process wasn&#39;t very quick, so over the years many algorithms have been developed to handle GC.</p>\n<p>The memory comes from the <em><strong>heap</strong></em>. The heap is where the objects of a Java program live. </p>\n<br>\n\n<h1 style=\"font-size:3em;\">Java bytecodes</h1>\n\n<p>Java programs are compiled into Java bytecodes. The JVM then executes these bytecodes, so they can be seen as the machine language of the JVM. The Java Compiler reads Java language <code>.java</code> files and turns them into bytecodes in <code>.class</code> files. </p>\n<p>The Java <em><strong>stack</strong></em> is used to store parameters for and results of bytecode instructions, to pass parameters to and return values from methods, and to keep the state of each method invocation.</p>\n<br>\n\n<h1 style=\"font-size:3em;\">JVM Components</h1>\n\n<p>JVM consists of three main components or subsystems:</p>\n<ul>\n<li><em><strong>Class Loader Subsystem</strong></em> is responsible for loading, linking and initializing a Java class file otherwise known as dynamic class loading.</li>\n<li><em><strong>Runtime Data Areas</strong></em> contain method areas, PC registers, heap, stack areas and threads.</li>\n<li><em><strong>Execution Engine</strong></em> contains an interpreter, compiler and garbage collection area.</li>\n</ul>\n<p>Lots of new terms in there, so let me try to explain them!</p>\n<div id=\"imageDiv\">\n  <figure>\n    <img src=\"https://joshlearningtocode.files.wordpress.com/2021/09/jvm-architecture.png\" alt=\"JVM Architecture\"/>\n    <figcaption>JVM Architecture</figcaption>\n  </figure>\n</div>\n\n<h2 style=\"font-size:2em;\">Class Loader</h2>\n\n<p>The class loader loads class files! Makes sense right. it is responsible for loading, linking and initialising Java class files.</p>\n<ol>\n<li><em><strong>Loading</strong></em>: The Class loader reads the <code>.class</code> file, and generates the corresponding binary data then saves it in the method area.</li>\n<li><em><strong>Linking</strong></em>: Performs verification (ensure the <code>.class</code> file is correct), preparation (allocates memory), and (optionally) resolution (replace symbolic references with direct references). </li>\n<li><em><strong>Initialisation</strong></em>: All static variables are assigned with their values defined in the code and static block (if any). This is executed from top to bottom in a class and from parent to child in the class hierarchy. </li>\n</ol>\n<h2 style=\"font-size:2em;\">Method Area</h2>\n\n<p>Stores things like class metadata, variable information, and code for methods. There is one method area per JVM.</p>\n<h2 style=\"font-size:2em;\">Heap</h2>\n\n<p>All the Objects, instance variables and arrays. Memory on the heap is shared across all threads, so again one per JVM.</p>\n<h2 style=\"font-size:2em;\">JVM Language Stacks</h2>\n\n<p>Java language stacks store local variables, and partial results. Each thread has its own JVM stack, created at the same time the thread is created. A new <em>frame</em> in the stack is created whenever a method is invoked, and it is deleted when method invocation process is complete.</p>\n<h2 style=\"font-size:2em;\">PC Registers</h2>\n\n<p>The PC register stores the address of the JVM instruction which is currently executing. Each thread has its separate PC register.</p>\n<h2 style=\"font-size:2em;\">Native Method Stacks</h2>\n\n<p>Native methods are used to move native code written in other languages into a Java application.</p>\n<h2 style=\"font-size:2em;\">Execution Engine</h2>\n\n<p>The execution engine is the central component of the JVM. It communicates with various memory areas of the JVM. Each thread of a running application is a distinct instance of the virtual machine’s execution engine. The Execution Engine itself contains 3 main components:</p>\n<ol>\n<li><em><strong>Interpreter</strong></em>: It reads the byte code and converts into the machine code and executes them in a sequential manner. The problem with the interpreter is that it interprets every time, even the same method multiple times, which reduces the performance of the system. To overcome this problem JIT Compilers were introduced.</li>\n<li><em><strong>JIT Compiler</strong></em>: JIT compiler counterbalances the interpreter’s disadvantage of slow execution and improves the performance.</li>\n</ol>\n<ul>\n<li>At run time, the JIT compiler converts the bytecode into machine code. The JIT compiler is activated when a method is called. If the method has already been compiled to machine code, that is called rather than re-interpreting the code.</li>\n<li>This does sacrifice start up time for application performance.</li>\n<li><em><strong>Profiler</strong></em>: This is a tool which is the part of JIT Compiler is responsible to monitor the java bytecode constructs and operations at the JVM level.</li>\n</ul>\n<ol start=\"3\">\n<li><em><strong>Garbage Collector</strong></em>: Already mentioned above.</li>\n</ol>\n<h2 style=\"font-size:2em;\">Native Method Interface and Libraries</h2>\n\n<p>Allows Java code which is running in a JVM to call libraries and native applications written in other languages.</p>\n<p>Reference: \n<a href=\"https://www.geeksforgeeks.org/jvm-works-jvm-architecture/\" target=\"_blank\">https://www.geeksforgeeks.org/jvm-works-jvm-architecture/</a></p>\n<p>So there it is, the JVM basically allows you to run Java code anywhere, and tries it&#39;s best to do it efficiently!</p>\n","slug":"2021-09-17-jvm","title":"Java Virtual Machine.","headline":"What is the JVM?","image":"./images/icons/java.png","sortdate":"2021-09-17","originaldate":"2021-09-17","tags":["Software Development","Java"]}