{"html":"<p>Yesterday was the first of two races at Silverstone in this years F1 season, which, despite an eventful last lap, has cemented the fact that Lewis Hamilton will claim his 7th World Championship this year.</p>\n<p>The first 50 laps were not uneventful, with two big crashes leading to safety cars. The first came at the end of lap 1, where Kevin Magnusson&#39;s Haas connected with Alex Albon&#39;s Red Bull, causing the Haas to spin off into the barriers and lose it&#39;s front left tyre. Perhaps an omen for later in the race... </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/magnussen crash.png\" alt=\"Kevin Magnussen's Haas Post Crash\">\n        <figcaption>Kevin Magnussen's Haas Post Crash</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=HmEsqWosuS8\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n\n<p>The second safety car was on lap 13, when the rear right tyre of Daniil Kvyat&#39;s AlphaTauri was punctured, sending him into the barrier. This lead to the front runners of the race pitting to put on hard tyres, which should have seen them through the next 39 laps to the end of the race. And for 37 of those laps they did, with a bit of tyre management, so it seemed like another easy 1 2 for Mercedes. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/kvyat crash.png\" alt=\"Daniil Kvyat's AlphaTauri Post Crash\">\n        <figcaption>Daniil Kvyat's AlphaTauri Post Crash</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=HmEsqWosuS8\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>On lap 50 however Valtteri Bottas&#39; Mercedes front left wheel was punctured, dropping him down the pack. By the time he was able to pit for new tyres he had already dropped out of the points positions. Max Verstappen, who was in third place in the Red Bull, flew passed him into second, behind Hamilton by about 15 seconds. The gap between second place Verstappen and third place Charles Leclerc in the Ferrari was over 30 seconds, so Red Bull called him into the pit to put fresh tyres on. He would still come out of the pit in second place, and could try and go for the fastest lap to earn an extra point, plus his tyres were no doubt struggling too. With no realistic chance of catching up to the Mercedes in first, this seemed like a sensible decision.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/bottas tyre.png\" alt=\"Valterri Bottas' Tyre Puncture\">\n        <figcaption>Valterri Bottas' Tyre Puncture</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=HmEsqWosuS8\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>Shortly after, Carlos Sainz suffered a puncture to the front left tyre of the McLaren, after having a decent race where he had gone from 7th in qualifying up to 4th place. This was a huge blow to McLaren, who were looking at 4th and 6th place finishes for their cars.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/sainz tyre.png\" alt=\"Carlos Sainz' Tyre Puncture\">\n        <figcaption>Carlos Sainz' Tyre Puncture</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=HmEsqWosuS8\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>Around the same time, 6 corners into the final lap, Hamilton suffered a puncture in his front left tyre. He was 36 seconds ahead of Verstappen in second place, thanks in part to the Red Bull pit stop, but still had half a lap to complete on 3 tyres. Around every corner the gap closed, and you could see the Red Bull in pursuit in the background, but Hamilton managed to drag the Mercedes home with 5.9 seconds to spare. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/hamilton finish.png\" alt=\"Lewis Hamilton Finishing the Race on 3 Tyres\">\n        <figcaption>Lewis Hamilton Finishing the Race on 3 Tyres</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=HmEsqWosuS8\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>The first place for Lewis meant he got his 7th win at his home race, surpassing Alain Prost&#39;s record of 6. He also set the record for most wins after leading every lap of the race, which now stands at 20. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/hamilton record.png\" alt=\"Hamilton Breaks Another Record\">\n        <figcaption>Hamilton Breaks Another Record</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p><strong>So what caused all these tyre issues?</strong> Well it isn&#39;t known at the moment, Pirelli are investigating to try and figure out the cause themselves. We do know the Silverstone is a tough track on the tyres, especially the front left due to all of the right turns. There may also have been debris on the track from the two crashes, and another incident where Kimi Räikkönen&#39;s front wing came off (which also punctured his front left tyre). The tyres had also been on for almost 40 laps at the time of failure, which is a long time, although within the number of laps they are rated for. The likely answer is a combination of all of these was the cause of the punctures. </p>\n<p>Outside of this drama, Leclerc managed 3rd place after holding on to 4th for most of the race (until Bottas&#39; crash). After that there was an interesting battle between Daniel Ricciardo in the Renault and the McLarens of Sainz and Lando Norris. Romain Grosjean did his best in the Haas to get involved in this battle, however he got into trouble as he didn&#39;t stop after the Safety Car and was handed a black-and-white flag for his defensive manoeuvres, and ended the race in 16th. Sebastian Vettel in the other Ferrari was nowhere to be seen in the battles, despite his teammate doing so well. Also Lance Stroll in the Racing Point did not have his best day, finishing 9th after qualifying in 6th.</p>\n<p>The other Racing Point did not even start the race, which gave a sad ending to an otherwise fairytale story for Nico Hulkenberg, who had flown in on Thursday night to replace Sergio Perez. Perez is likely to miss the next race still, so Hulkenberg has a chance to make an impression next week.</p>\n<p>Here are all the points scorers from Silverstone this week:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/silverstone results.jpg\" alt=\"Silverstone Top 10\">\n        <figcaption>Silverstone Top 10</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>As Bottas dropped to 11th after his tyre troubles and scored no points, Hamilton is now leading the championship by 30 points.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"./images/2020-08-03 F1 2020 - Silverstone/driver standings.png\" alt=\"Current F1 Driver Standings\">\n        <figcaption>Current F1 Driver Standings</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>The action continues at Silverstone next week, with the 70th Anniversary GP.</p>\n","slug":"F1 2020 - Silverstone","title":"F1 Recap - Silverstone 2020.","headline":"Hamilton hangs on to victory","image":"./images/2020-08-03 F1 2020 - Silverstone/f1 logo.png","sortdate":"2020-08-03","originaldate":"2020-08-03","tags":["Formula 1"]}