{"html":"<p>Max Verstappen claimed victory in the 70th Anniversary Grand Prix at Silverstone much to his surprise, proving that it might not just be a one horse race this year.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/verstappen-victory.png\" alt=\"Verstappen takes 1st place\">\n        <figcaption>Verstappen takes 1st place</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=ffonCbGgzt0\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>Verstappen was able to take the win due to running on a different strategy to the rest of the grid, and the Red Bull car being easier on the tires compared to the Mercedes. </p>\n<p>Despite starting 2nd, Lewis Hamilton had lots of tyre issues, causing him to lose places. He was able to fight his way back up to second, just ahead of teammate Valterri Bottas, who finished in 3rd, and might have been less than happy with his teams strategy. He was pitted for his third set of tyres much earlier than Hamilton, which meant he could not keep up with the pace of the other Mercedes.</p>\n<p>Charles Leclerc also had an outstanding drive in the Ferrari, qualifying 8th but bringing the car home in 4th place on a one stop strategy. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/silverstone2-leclerc-midfield-overtaking.jpg\" alt=\"Leclerc overtaking Lando Norris' McLaren\">\n        <figcaption>Leclerc overtaking Lando Norris' McLaren</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>He also massively outperfored his teammate, 4 time world champion Sebastian Vettel, who finished 12th after spinning early on. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/seb-spin-1.png\" alt=\"Vettel facing the wrong way\">\n        <figcaption>Vettel facing the wrong way</figcaption>\n        <figcaption>Source: <a href=\"https://www.youtube.com/watch?v=ffonCbGgzt0\" target=\"_blank\">Formula 1 YouTube Race Highlights</a></figcaption>\n    </figure>\n</div>\n\n<p>Verstappen started the race on the hard compound tyres, and was quickly able to overtake Nico Hulkenberg&#39;s Racing Point to go from 4th to 3rd place. He kept very close the the two Mercedes&#39; in front, who quickly started to struggle with their medium tyres. They were beginning to blister and reducing the performance of the car. On lap 13 and 14, Bottas and Hamilton respectively pitted for hard tyres. Verstappen took the lead because of this, and despite being on older tyres, he extended his lead as once again the Mercedes tyres started to blister.</p>\n<p>Verstappen was actually told on lap 11 to ease off to maintain his tyres, but he disagreed with the team orders sensing an opportunity to catch the Mercedes, an opportunity that doesn&#39;t come up often. In his words, he didn&#39;t want to drive like a &quot;grandma&quot;.</p>\n<div id=\"imageDiv\">\n    <p class=\"tweetToEmbed\" style=\"display: none;\">1292573366981816320</p>\n</div>\n\n<p>Verstappen did pit on lap 26 for mediums, which lead to a little battle with Bottas, however he was able to maintain 1st place. On lap 32 they both pitted again for fresh hard tyres.</p>\n<p>Hamilton also had blistered tyres, but the team kept him out for another 9 laps, as he was doing well maintaining a gap of 10 seconds to Vertsappen and Bottas behind him. He finally went into the pit on lap 41 for fresh hard tyres, coming back out with much more grip than the other cars. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/silverstone2-hamilton-tyres.jpg\" alt=\"Hamilton's Tyres Pre Stop\">\n        <figcaption>Hamilton's Tyres Pre Stop</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>He came out behind Leclerc, but was easily able to pass him, quickly catching up to Bottas in 2nd. The freshness of his tyres allowed him to pass, however he was still 9 seconds behind Verstappen with only two laps to go, and ultimately was not able to get close to him.</p>\n<p>At the end of the race, you could hear Hamilton asking Verstappen if they were having any tyre trouble, to which Max happily answered that they did not. </p>\n<p>Hamilton did secure fastest lap, earning him an extra point, and giving him a 34 point lead over Bottas. Verstappen moved into second after this win, now only 30 points behind Hamilton.</p>\n<p>Verstappen&#39;s Red Bull teammate Alex Albon had a really good race to get 5th place, with lots of great midfield overtakes, finishing ahead of both Racing Points. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/silverstone2-albon-overtake.jpg\" alt=\"Albon overtakes Kimi Räikkönen in the Alfa Romeo\">\n        <figcaption>Albon overtakes Kimi Räikkönen in the Alfa Romeo</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>Nico Hulkenberg actually managed to race this week, but may be dissapointed to have finished 7th behind teammate Lance Stroll after such a strong qualifying performance, which saw him start 3rd on the grid. He reported strange vibrations in the back of the car, and the team decided he needed to pit. They say it is unlikely he would have finished the race otherwise, so 7th is better than nothing.</p>\n<div id=\"imageDiv\">\n    <p class=\"tweetToEmbed\" style=\"display: none;\">1292472874217897986</p>\n</div>\n\n<p>Here are the results from this week:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/silverstone2-results.jpg\" alt=\"70th Anniversary GP Results\">\n        <figcaption>70th Anniversary GP Results</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>And here are the driver standings now:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/driver-standings-after-silverstone2.jpg\" alt=\"Current F1 Driver Standings\">\n        <figcaption>Current F1 Driver Standings</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>After these last two races, it looks like the Mercedes might struggle with their tyres in warmer weather. The blowouts from last week were avoided after Pirelli told teams to increase the tyre pressure by 2psi, however the tyres blistered and wore quickly on the Mercedes cars. </p>\n<p>I guess we will see next race if they can fix these problems, as we head to Barcelona next week!</p>\n","slug":"f1_2020_70th_anniversary_gp","title":"F1 Recap - 70th Anniversary Grand Prix 2020.","headline":"Brilliant strategy leads to Red Bull win","image":"./images/icons_same_size/f1 logo 2020.png","sortdate":"2020-08-09","originaldate":"2020-08-09","tags":["Formula 1"]}