{"html":"<p>An intense debut race at Mugello, as only 12 cars finished, and Alex Albon finally gets his first podium in the Red Bull. Mercedes for the first time this season (unbelievable, I know) pick up maximum points, with Lewis Hamilton and Valterri Bottas finishing 1st and 2nd, and Hamilton also getting fastest lap.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-lewis-wins.jpg\" alt=\"Lewis Hamilton Wins the Tuscan GP\">\n        <figcaption>Lewis Hamilton Wins the Tuscan GP</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>The start of the race was pretty interseting, with Hamilton jumping a little bit, then losing out on first place on the first corner to Bottas, a dream start for the Fin. Also having a bad start was Max Verstappen in the other Red Bull, who seemingly had power issues that dropped him way back from 3rd where he qualified, to right near the back. This didn&#39;t last long however, as on turn 2, Kimi Raikkonen was battling Romain Grosjean in the Haas, and Pierre Gasly in the Alpha Tauri, and nudged Verstappen into the gravel. Gasly was also squeezed out, and both Verstappen and Gasly had to retire from the race after just two turns. </p>\n<div id=\"imageDiv\">\n    <p class=\"tweetToEmbed\" style=\"display: none;\">1305186981325025288</p>\n</div>\n\n<p>Carlos Sainz in the McLaren also had a bad start, spinning early on to drop down the order to 15th, but Charles Leclerc in the birthday boys Ferrari did really well off the start, shooting up into 3rd place. Williams&#39; George Russell and Haas&#39; Kevin Magnussen both benefitted from the early drama getting up to 11th and 12th from 18th and 20th respectively.</p>\n<p>A safety car was deployed to deal with the two stranded cars, which the cars stayed behind until lap 7. Immediately upon the race restart, there was a huge crash towards the back of the pack. Magnussen had slowed down due to the cars in front slowing, Nicholas Latifi in the Williams behind him reacted late and had to swerve around the Haas, but Antonio Giovinazzi in his Alfa Romeo behind Latifi didn&#39;t have time to react to the stopped Haas now in front of him. He collided pretty quickly into the back of him, then into Latifi. Sainz who was coming behind them also crashed into the pile up, unable to avoid it.</p>\n<div id=\"imageDiv\">\n    <p class=\"tweetToEmbed\" style=\"display: none;\">1305176355471065089</p>\n</div>\n\n<p>Luckily all the drivers involved in the crash were unharmed, and walked away. Carlos Sainz was holding his wrist as he walked away, and the footage shows that his cars halo saved him from a large piece of debris, so he will be very thankful for it. Due to the size and location of the crash, the race was red flagged, for the second time in two weeks. Bottas led the cars into the pit, as we waited for everything to be cleared up. </p>\n<p>During the red flag, Esteban Ocon&#39;s Renault had issues with overheating brakes, so he also had to retire. 7 cars were now already out of the race, with barely a lap of actual racing. The cars were ready to race again, and lined up after the formation lap. Hamilton was sitting in second on the grid, with smoke bellowing out from his brakes, but clearly this was no issue, as from the second lights out he did not make the same mistake as the first. He dropped in right behind Bottas to gain a slipstream, then flew around him on the first turn.</p>\n<p>Leclerc was still in 3rd at this point, with Lance Stroll and Checo Perez in the Racing Point&#39;s behind him. Albon had an awful restart, dropping down to 7th place, after having a similar start to the restart that his teammate Verstappen had had at the beggining. Daniel Ricciardo in the Renault was in 6th after the restart, and quickly made his way around both Racing Points and the Ferrari of Leclerc who had fallen behind Stroll. Here were the standings at this point:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-race-standings-after-red-flag.jpg\" alt=\"Standings After Red Flag\">\n        <figcaption>Standings After Red Flag</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>Bottas on the radio at this point asked his team to put him on the opposite strategy to Hamilton. Clearly frustrated with recent results, Bottas just wanted a chance to take 1st place from his teammate, which will not happen if they are on a level playing field. Unfortunately for him, his tyres needed replacing first. He pitted for hard tyres, which Hamilton replicated a lap later. </p>\n<p>During all this, George Russell had made his way into the points positions, getting up to 9th place at one point. It looked like he was nailed on to finish in 9th, and definitely in the points. Ricciardo in 3rd was also looking like a sure thing for a podium, which <a target=\"_blank\" href=\"https://www.formula1.com/en/latest/article.he-chooses-placement-but-i-choose-the-design-ricciardo-reveals-tattoo-bet.1XiqmTbs2WoB4Xbb8jeCNC.html\">may have been filling Renault team principal Cyril Abitebole with mixed emotions</a>. </p>\n<p>The Mercedes&#39; were miles ahead at this point, however both were told by their pitwall to avoid using the kerbs to avoid any unnecessary tyre degredation. At this point Bottas told his engineer how much he would love a safety car to enable him to refresh his tyres. </p>\n<p>Well, a few laps later his wish came true. Lance Stroll, who had been running in the top 5 for most of the race and was battling Albon for 4th place, suffered what seemed like a puncture, which took control of his car away from him completely. Through no fault of his own he was sent careening into the tyre wall. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-strolls-crash.gif\" alt=\"Stroll Crash\">\n    </figure>\n</div>\n\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-strolls-crashed-car.jpg\" alt=\"Lance Strolls Crashed Racing Point\">\n        <figcaption>Lance Strolls Crashed Racing Point</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>Bottas did indeed take advantage of this, jumping into the pits where teammate Hamilton was unable to. Fortunately for Lewis, the safety car did not get out in front of him, so he was indeed able to pit and retain first place. In the end it didn&#39;t really matter, as the race was red flagged <strong>again</strong> in order to remove the car and fix the tyre wall.</p>\n<p>Stroll crashing out means that all 3 of the podium finishers from last week did not finish this week, all 3 retiring in 3 different crashes. It was also the first time since Brazil 2016 that there was 2 red flags in a single race. </p>\n<p>We got a nice inside view of the Racing Point after the marshals opened it up to extinguish a fire.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-strolls-crashed-car-insides.jpg\" alt=\"Inside Lance Strolls Crashed Racing Point\">\n        <figcaption>Inside Lance Strolls Crashed Racing Point</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>So coming into the 2nd red flag, Russell was looking set for a points finish still in 9th, and Ricciardo was finally looking to get back on the podium sitting in 3rd place. After another short rest for the drivers, the cars were lined up to restart, again!</p>\n<p>Hamilton had another great start, and Bottas again did not. Ricciardo was able to pass Bottas and get into 2nd place. Russell however fell all the way down to 12th after a bad start. Ricciardo didn&#39;t have much time to enjoy 2nd place, as on turn 1 of the next lap Bottas easily took it back, even without DRS enabled. </p>\n<p>George Russell was desperately trying to get back into the points, overtaking Grosjean to get to 11th, and getting ever closer to Sebastien Vettel in the Ferrari in 10th. Raikkonen who was in 8th had been given a 5 second penalty for unsafe entry into the pitlane, so Russell just had to close the gap to Raikonnen to less than 5 seconds, even if he didn&#39;t pass Vettel. Unfortunately for him, he was not able to, and is still yet to score a point in F1. </p>\n<p>Up the front, Ricciardo was facing massive pressure from Albon in 4th. On lap 51, Albon was able to use DRS to get past Ricciardo easily, and was starting to hunt down Bottas. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-albon-overtaking-ricciardo.jpg\" alt=\"Albon Overtaking Ricciardo\">\n        <figcaption>Albon Overtaking Ricciardo</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<div id=\"imageDiv\">\n    <p class=\"tweetToEmbed\" style=\"display: none;\">1305199564379402241</p>\n</div>\n\n<p>Bottas started to pick up the pace, getting away from Albon and trying to get into DRS range of Hamilton. He pushed as hard as he could, however coming into the last lap he was still a second behind Hamilton, who had just set the fastest lap time. Hamilton opened the tap on the last two laps, and cruised away from Bottas to take his 90th Formula 1 victory. As is tradition at the moment, he broke some more records; 42 consecutive points finishes and 222 career points finishes for Hamilton.</p>\n<p>Albon came in 3rd, and thanked his team for sticking with him as he takes his first podium. </p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-alex-trophy.jpg\" alt=\"Albons First Trophy\">\n        <figcaption>Albons First Trophy</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/redbullracing\" target=\"_blank\">Red Bull Racing Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>Even though Ricciardo was unable to hang onto a podium position, he was voted driver of the day by the fans.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-danny-ricc-dotd.jpg\" alt=\"Danny Ricc Driver of the Day\">\n        <figcaption>Danny Ricc Driver of the Day</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>Sergio Perez came home 5th after a decent race, especially considering <a target=\"_blank\" href=\"https://www.formula1.com/en/latest/article.nobody-told-me-anything-perez-weighs-up-future-as-he-admits-surprise-at.77PgjTCq2cVm5Hvvv6CXVi.html\">the week he has had</a>, and Lando Norris finished in the McLaren in 6th place. McLaren are currently 3rd in the constructors championship this year, which is very exciting as next year they get a shiny new Mercedes engine, hopefully making them even more competitive.</p>\n<p>Here are the results from this week:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-race-results.jpg\" alt=\"Tuscan GP Results\">\n        <figcaption>Tuscan GP Results</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n<p>And here are the driver standings now, Hamilton 55 points ahead, and Bottas extending his gap to third to 25 points:</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/09/f1-2020-tuscan-gp-standings.jpg\" alt=\"Current F1 Driver Standings Top 10\">\n        <figcaption>Current F1 Driver Standings Top 10</figcaption>\n        <figcaption>Source: <a href=\"https://twitter.com/F1\" target=\"_blank\">Official F1 Twitter</a></figcaption>\n    </figure>\n</div>\n\n\n<p>So Ferrari celebrate their 1000th GP by having both cars finish in the points, which is about as good as it gets for them at the moment, and all it took was 8 other cars crashing out of the race.</p>\n<p>We have a week to recover from this one, then back into action in Russia on the 25th of September.</p>\n","slug":"f1_2020_tuscan_gp","title":"F1 Recap - Tuscan Grand Prix 2020.","headline":"2 Red Flags on Another Crazy Day in Italy","image":"./images/icons_same_size/f1 logo 2020.png","sortdate":"2020-09-13","originaldate":"2020-09-13","tags":["Formula 1"]}