{"html":"<p>I am a huge fan of Kanye West&#39;s music. So much so that I was even born on the same day as him, (just a few years later). I decided it would be fun to rank all of his albums, which basically just gives me an excuse to listen to them all again. Here are the ones I am including in this list:</p>\n<ul>\n<li>The College Dropout</li>\n<li>Late Registration</li>\n<li>Graduation</li>\n<li>808s &amp; Heartbreak</li>\n<li>My Beautiful Dark Twisted Fantasy</li>\n<li>Watch the Throne</li>\n<li>Yeezus</li>\n<li>The Life of Pablo</li>\n<li>Ye</li>\n<li>Kids See Ghosts</li>\n<li>Jesus is King</li>\n</ul>\n<p>This list is entirely based on my preference, heavily influenced by nostalgia, which may explain some choices.</p>\n<p>This was very tough for me, as on attempting to rank the albums, I realised that I really enjoy listening to all of them. Even the albums at the bottom of this list would appear at the top of my favourite albums overall.</p>\n<p>So here we go, from the bottom:</p>\n<br>\n\n<h2 id=\"11-jesus-is-king\">11. Jesus is King</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/jik.jpg\" alt=\"Jesus is King\">\n        <figcaption>Jesus is King</figcaption>\n    </figure>\n</div>\n\n<p>JIK is currently the most recent Kanye album (until DONDA drops, please!). It is heavily focussed around Christianity and is more of a gospel album. I am not a religious person, so a lot of the message is lost on me, that said there are still some real good songs on there. It has a very soulful feeling on most of the songs, which reminds me of some of the earlier Kanye songs.  </p>\n<br>\n\n<h2 id=\"10-watch-the-throne\">10. Watch The Throne</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/wtt.jpg\" alt=\"Watch The Throne\">\n        <figcaption>Watch The Throne</figcaption>\n    </figure>\n</div>\n\n<p>When WTT was announced I was so excited, Jay Z and Kanye, a whole album together. It promised to be very good. And it was. Kanye made his start producing songs for Jay Z, and Jay Z had appeared on a remix of Power after the release of My Beautiful Dark Twisted Fantasy, which was what sparked this album. To me, WTT feels like the perfect transition between MBDTF and Yeezus. However I want to give a quick fuck you to Spotify on this one for the 3 minutes of silence before Illest Motherfucker Alive, it&#39;s such a good song, but it&#39;s so hard to listen to in the car because you can&#39;t skip the silence (I still love you though Spotify).</p>\n<br>\n\n<h2 id=\"9-kids-see-ghosts\">9. Kids See Ghosts</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/ksg.jpg\" alt=\"Kids See Ghosts\">\n        <figcaption>Kids See Ghosts</figcaption>\n    </figure>\n</div>\n\n<p>KSG is a collaboration album between Kanye West and Kid Cudi, which automatically means it was always going to be good. Kid Cudi makes some great music, and whenever the two have teamed up the results have always been good music. KSG is no exception, and despite also only being 7 tracks, it has a great mix of high energy and emotional songs. The album had great aesthetics too, with Takashi Murakami providing the album cover. Hopefully Kids See Ghosts will release more music, and the animated show will actually come out.</p>\n<br>\n\n<h2 id=\"8-808s--heartbreak\">8. 808s &amp; Heartbreak</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/808s.jpg\" alt=\"808s & Heartbreak\">\n        <figcaption>808s & Heartbreak</figcaption>\n    </figure>\n</div>\n\n<p>808s was the first album where Kanye started to try completely new ideas. The album was fuelled by some tragic events in Kanye&#39;s life. Mostly the passing of his mother Donda, who he was incredibly close to. Kanye moved away from rapping and into auto tuned singing for this album, giving it a more electronic feel. 808s was a massive influence to other artists, rather than rapping about guns and money, Kanye was singing about his feelings, which laid the groundwork for artists such as Drake, Childish Gambino and Frank Ocean.</p>\n<br>\n\n<h2 id=\"7-ye\">7. Ye</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/ye.jpg\" alt=\"Ye\">\n        <figcaption>Ye</figcaption>\n    </figure>\n</div>\n\n<p>The first album from Wyoming, which started a newer era of Kanye.  This album had quite a different feeling from his other albums, and was the first time he really talks about being bi-polar.  Ye marked the return to more soulful samples, a shift from The Life of Pablo which came before. One of the downsides of this album was that it was only 7 tracks. This was because Kanye was producing 4 other albums, for Pusha T, Teyana Taylor, Nas and Kids See Ghosts with Kid Cudi. It was a good summer to be a Kanye fan, with lots of new music coming.</p>\n<br>\n\n<h2 id=\"6-the-life-of-pablo\">6. The Life of Pablo</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/tlop.jpg\" alt=\"The Life of Pablo\">\n        <figcaption>The Life of Pablo</figcaption>\n    </figure>\n</div>\n\n<p>TLoP came after the biggest gap between albums for Kanye, and I remember it sure felt like it. Pablo was a revolutionary album of sorts, as it&#39;s the first time I can think of an album evolving after release. Kanye added a new song in Saint Pablo, replaced Facts with a remix, and also made changes to other songs.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/ima-fix-wolves.jpg\" alt=\"ima fix wolves tweet\">\n        <figcaption>Kanye Tweeting about changing the album</figcaption>\n    </figure>\n</div>\n\n<p> I still have the original released version downloaded on an old phone somewhere, which is always interesting to listen to. The music itself was good too, it really marked the beginning of a more Christian sound to Kanye&#39;s albums. Ultralight Beam with Chance and Father Stretch My Hands were soulful and religious, but still absolute bangers. All that being said, this album contains one of the only Kanye songs that I will always skip, Low Lights.</p>\n<br>\n\n<h2 id=\"5-graduation\">5. Graduation</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/graduation.jpg\" alt=\"Graduation\">\n        <figcaption>Graduation</figcaption>\n    </figure>\n</div>\n\n<p>Graduation marked the move away from soulful samples, instead using a wider range of music to sample from. The most obvious example of this would be Stronger, where Kanye samples Daft Punks Harder, Better, Faster, Stronger. The album was smaller than the previous two, but didn&#39;t contain any skits like they had. The songs on Graduation feel more like they should be played in a club or stadium, where you can sing and dance with other people. Graduation has my favourite album cover too, I love the Kanye bear, the colours, and just everything about it.</p>\n<p>While I am here, shoutout to <a href=\"https://collection-26.myshopify.com/\" target=\"_target\">Collection26</a> for creating this dope hoodie. I hope they make more.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://p3rf6g.am.files.1drv.com/y4mTzrannukzm4F3eLRz2_MNbDG5K9PMWkAP8qhpAf3Z98gHlp0m2LawMxs7o9fRNTZCbWQKyDfulTQ1Ncnj-bQqLQEeellqcHyz5LsVyM_Mby2cCur8cAZ45KNZawcdLKYx-oq3F0KqHg_d53LICuTgsq_9pezJc-QKqN0YvPlZ2m73x3l4H2LZMks9fVvsrkoGFXUlwfYo0SOQQ4WCQ6tNQ\" alt=\"My Graduation Hoodie\">\n        <figcaption>My Graduation Hoodie</figcaption>\n    </figure>\n</div>\n\n<br>\n\n<h2 id=\"4-the-college-dropout\">4. The College Dropout</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/tcd.jpg\" alt=\"The College Dropout\">\n        <figcaption>The College Dropout</figcaption>\n    </figure>\n</div>\n\n\n<p>Kanye West&#39;s debut album, containing two of his greatest songs. Through The Wire which was recorded after a car crash that almost killed him, and Jesus Walks, which proved rapping about religion could still make good music. This album was pure Kanye, soulful beats and chopped up samples, and carried the message that you should do what you want to do, follow your passions, college is not the only route. As someone who didn&#39;t go to university and instead have ended up following my passion and learning my own way, the message clearly stuck with me.</p>\n<br>\n\n<h2 id=\"3-late-registration\">3. Late Registration</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/lr.jpg\" alt=\"Late Registration\">\n        <figcaption>Late Registration</figcaption>\n    </figure>\n</div>\n\n<p>Late Registration, like many others my age, was my introduction to Kanye West. In the UK, Gold Digger and Touch The Sky were played often on the radio and music channels. My mum listened to lots of music, which is how I first heard it. She has great taste in music, so I grew up listening to Kanye, Busta Rhymes and Black Eyed Peas among others. Even without my nostalgic bias, this album is fantastic. It felt like Kanye had mastered his soulful sampling from College Dropout, and even the skits were funnier. I still remember all the words to the skits, thats how much I listened to the album.</p>\n<br>\n\n<h2 id=\"2-my-beautiful-dark-twisted-fantasy\">2. My Beautiful Dark Twisted Fantasy</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/mbdtf.jpg\" alt=\"My Beautiful Dark Twisted Fantasy\">\n        <figcaption>My Beautiful Dark Twisted Fantasy</figcaption>\n    </figure>\n</div>\n\n<p>This is probably the big surprise. Most people would call this Kanye&#39;s greatest album, his magnum opus, and there&#39;s good reason for that. It is a fantastic album. It is a grand amalgamation of all his previous albums, and it feels like the end of a journey. College Dropout, Late Registration and Graduation deal with his life during and after college and the start of his career, and 808s is all about his career and handling some terrible times. MBDTF is the end of the road, he is world famous, and with that comes the sex, drugs and alcohol. Some of Kanye&#39;s best music is on this album, Power for one is still played on adverts and in sports stadiums to this day because it does make you want to get up and sing and dance. Gorgeous, Monster, Hell of a Life, every song on the album fits together perfectly and sounds amazing. Runaway is a brilliant song, and it lasts 9 minutes, it&#39;s hard to make people want to sit through any song for 9 minutes, but the time really flies. It was incredibly close between this and my number one, and even as I write this I&#39;m not sure. </p>\n<br>\n\n<h2 id=\"1-yeezus\">1. Yeezus</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/yeezus.jpg\" alt=\"Yeezus\">\n        <figcaption>Yeezus</figcaption>\n    </figure>\n</div>\n\n<p>I love this album. This is top of my list because I love high energy music, I want to sing as loud as possible while I am jumping up and down to a sick beat. This is the album for me. I can only describe it as dirty electronic punk music, it sounded completely different to anything I had heard before. This came out when I was 18, which meant I had my own car to blast the album whilst cruising down the M25. I could go out drinking and get hyped with this album. I put this album on in the background while writing this, and I couldn&#39;t help but get distracted singing along and head banging. I also got to experience it live at Wireless Festival in 2014. And it was a full Kanye experience, not only did I get to hear the music surrounded by thousands of other Kanye fans, he also infamously went on a rant for during his performance. I hope I can see him live again one day, because it was truly amazing.</p>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://j9mqxg.am.files.1drv.com/y4mmZxj5nJrjlQF9HBctFiJfWeY55RLBNUW3fzoYvr8tYrV6byrxhRsyUcJIwTDGveuALTxmIQgVCKW3s458XCSGK-nhv0HyJEvUvHexHawRyLmdmKo6gyPWJT-p_w38Z2k4elCpF14R2i89qP2qB5SLBRG8UQKxaZR3ehvn30SRE6gRGw1WiHegxVEmhiTn0xa7YHW9cFUKSwbIEUhraCQ5w\" alt=\"Kanye Live in London\">\n        <figcaption>Kanye Live in London</figcaption>\n    </figure>\n</div>\n\n<br>\n\n<p>The latest single at the time of writing this, Wash Us in the Blood, has a really Yeezus feel to it, so I really hope DONDA comes out and blows me away!</p>\n<p>Either way Kanye West will no doubt take his place at the top of my most played artist list on Spotify, as he has every year since they introduced the Spotify Wrapped recaps.</p>\n<br>\n\n<h2 id=\"special-mention-kanye-west-presents-good-music-cruel-summer\">Special Mention. Kanye West Presents Good Music Cruel Summer</h2>\n<div id=\"imageDiv\">\n    <figure>\n        <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/kwpgmcs.png\" alt=\"Kanye West Presents Good Music Cruel Summer\">\n        <figcaption>Kanye West Presents Good Music Cruel Summer</figcaption>\n    </figure>\n</div>\n\n<p>Cruel Summer is a compilation album of music from artists who were signed to Kanye&#39;s GOOD Music label. Kanye features or has produced most of the songs on the album, but it is not really a Kanye album, hence it&#39;s exclusion from the list. I did want to mention it though because I don&#39;t hear much about it, and it has some really good music (see what I did there) on it.</p>\n<br>\n\n<h2 id=\"special-mention-2-yandhi\">Special Mention 2. Yandhi</h2>\n<p>I recently started listening to the Yandhi leaks. Yandhi was meant to drop before JIK, going as far Kanye tweeting a release data and album cover. </p>\n<div id=\"imageDiv\">\n\n  <figure>\n    <img src=\"https://joshlearningtocode.files.wordpress.com/2020/08/yandhi.jpg\" alt=\"Yandhi Cover\">\n    <figcaption>Yandhi Cover</figcaption>\n  </figure>\n\n  <p class=\"tweetToEmbed\" style=\"display: none;\">1041895861716832256</p>\n</div>\n\n<p>Yandhi had more of a Yeezus feel than Ye did, which had come out a few months prior, which obviously got me excited. Unfortunately the release date came and went, with no mention of an album again from Kanye. Later Kanye started his Sunday Service project, and JIK came out. Some Yandhi songs were reworked for JIK, and the album was officially dead. I&#39;m not sure why, but until recently I had avoided listening to the leaks, I didn&#39;t want to listen to a bunch of low quality demo tracks recorded on someones phone, I had no idea the leaks were such high quality. I&#39;ve been listening to it a lot recently, but I felt it wasn&#39;t fair to put it on the list for two reasons:</p>\n<ol>\n<li>I haven&#39;t listened to it enough</li>\n<li>It wasn&#39;t actually released. Who knows what changes Kanye would have made to it if he went forward with the album. As we saw with Pablo, he could change the music right up to and after the album release date.</li>\n</ol>\n<p>It&#39;s a shame really, because I think a finished Yandhi definitely gets into my top 5, hopefully some of the tracks make it onto DONDA or whatever album comes next.</p>\n<p>While I am talking about Kanye, here is a Kanye West album picker I created one lunchtime at work when I was feeling bored and couldn&#39;t decide what to listen to. It doesn&#39;t really work on mobile, one day I will go back and make it much nicer, but probably not anytime soon.\n<a href=\"https://joshglasson.github.io/KanyeAlbumPicker/Wheel.html\" target=\"_blank\">Wheel of Kanye</a></p>\n","slug":"kanye_west_albums_ranked","title":"Ranking Every Kanye West Album.","headline":"My ranking of all of Kanye West's released albums","image":"./images/icons_same_size/kanye bear.png","sortdate":"2020-08-07","originaldate":"2020-08-07","tags":["Music"]}